# 02.파이썬라이브러리-Pandas

## Pandas 설치하기

In [ ]:
!pip install pandas

## Pandas 사용

In [1]:
import pandas as pd

pd.__version__

'1.3.0'

## Pandas 사용 사례

### 1. 딕셔너리 데이터를 DataFrame 데이터로 보여주기

In [28]:
import pandas as pd

datas = {2004:[472761,108.2], 2005:[435031,107.8], 2006:[448153,107.5], 
         2007:[493183,106.2], 2008:[465891,106.4], 2009:[444849,106.4],
         2010:[470171,106.9], 2011:[471265,105.7], 2012:[484550,105.7]}

df = pd.DataFrame(datas, index=['출생아수', '출생성비'])
df.columns.name = '년도'
df

년도,2004,2005,2006,2007,2008,2009,2010,2011,2012
출생아수,472761.0,435031.0,448153.0,493183.0,465891.0,444849.0,470171.0,471265.0,484550.0
출생성비,108.2,107.8,107.5,106.2,106.4,106.4,106.9,105.7,105.7

### 2. 사이킷런 빌트인 데이터셋 DataFrame 데이터로 보여주기

In [29]:
# 사이킷런 빌트인 데이터셋(sklearn.datasets): 붓꽃
from sklearn.datasets import load_iris

iris = load_iris()

df = pd.DataFrame(iris['data'], columns=iris['feature_names'])
df

     sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
0                  5.1               3.5                1.4               0.2
1                  4.9               3.0                1.4               0.2
2                  4.7               3.2                1.3               0.2
3                  4.6               3.1                1.5               0.2
4                  5.0               3.6                1.4               0.2
..                 ...               ...                ...               ...
145                6.7               3.0                5.2               2.3
146                6.3               2.5                5.0               1.9
147                6.5               3.0                5.2               2.0
148                6.2               3.4                5.4               2.3
149                5.9               3.0                5.1               1.8

[150 rows x 4 columns]

### 3. csv 파일 읽어와서 DataFrame 데이터로 보여주기
- https://www.kaggle.com/datasets/uciml/iris 데이터 다운로드

In [30]:
import pandas as pd

df = pd.read_csv('data/iris.csv')
df

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
0,1,5.1,3.5,1.4,0.2,Iris-setosa
1,2,4.9,3.0,1.4,0.2,Iris-setosa
2,3,4.7,3.2,1.3,0.2,Iris-setosa
3,4,4.6,3.1,1.5,0.2,Iris-setosa
4,5,5.0,3.6,1.4,0.2,Iris-setosa
...,...,...,...,...,...,...
145,146,6.7,3.0,5.2,2.3,Iris-virginica
146,147,6.3,2.5,5.0,1.9,Iris-virginica
147,148,6.5,3.0,5.2,2.0,Iris-virginica
148,149,6.2,3.4,5.4,2.3,Iris-virginica
149,150,5.9,3.0,5.1,1.8,Iris-virginica

------

## Pandas 데이터 구조

-  Series 객체: 1차원 배열, 1차원 ndarray와 호환
- DataFrame 객체: 2차원 배열. 서로 다른 자료형을 사용 가능. 행(인스턴스), 열(컬럼, 피쳐(feature))

## 1. Series 객체

### Series 객체 정의하기
- **pandas.Series**(data=None, index=None, dtype=None, name=None, copy=False, fastpath=False)

In [31]:
data = pd.Series([4, 7, -5, 3])
data

0    4
1    7
2   -5
3    3
dtype: int64

In [32]:
print(data.values)
print(data.index)
print(data.dtype)

[ 4  7 -5  3]
RangeIndex(start=0, stop=4, step=1)
int64

#### - Series  인덱스 넣어 객체 정의하기

In [72]:
data = pd.Series([4, 7, -5, 3], index=['a','b','c','d'])
data

a    4
b    7
c   -5
d    3
dtype: int64

#### - 날짜를 Series로 만들기
- pandas.date_range(start=None, end=None, periods=None, freq=None, tz=None, normalize=False, name=None, closed=NoDefault.no_default, inclusive=None, **kwargs)
- https://pandas.pydata.org/docs/reference/api/pandas.date_range.html#

In [75]:
dates = pd.date_range("20130101", periods=6)

data = pd.Series(dates)

data

0   2013-01-01
1   2013-01-02
2   2013-01-03
3   2013-01-04
4   2013-01-05
5   2013-01-06
dtype: datetime64[ns]

#### - python의 dictionary 자료형을 Series data로 만들 수 있다

In [35]:
# dictionary의 key가 Series의 index가 된다
dicData = {'국어': 90, '영어': 85, '수학': 95, '과학': 75}
data = pd.Series(dicData)
data

국어    90
영어    85
수학    95
과학    75
dtype: int64

In [36]:
data.index.name = '과목'
data.name = '성적'
data

과목
국어    90
영어    85
수학    95
과학    75
Name: 성적, dtype: int64

### Series 인덱스 변경하기

In [73]:
data.index = ['A','B','C','D']
data

A    4
B    7
C   -5
D    3
dtype: int64

### Series 인덱싱

In [2]:
data = pd.Series({'국어': 90, '영어': 85, '수학': 95, '과학': 75})

data[1:2]

영어    85
dtype: int64

In [3]:
data['영어':'과학']

영어    85
수학    95
과학    75
dtype: int64

In [6]:
data[['영어','과학']]

영어    85
과학    75
dtype: int64

In [7]:
data[data > 90]

수학    95
dtype: int64

In [8]:
data[(data>80) & (data<100)]

국어    90
영어    85
수학    95
dtype: int64

### 시리즈 연산 : value에만 적용됨
- 넘파이 배열처럼 시리즈도 벡터화 연산을 할 수 있다. 
- 인덱스(index) 값은 변하지 않고, 값( value) 에만 적용된다

##### (인덱스 값이 동일한 두 개의 시리즈인 경우 연산)

In [40]:
data1 = pd.Series({'국어': 90, '영어': 85, '수학': 95, '과학': 75})
data2 = pd.Series({'국어': 80, '영어': 95, '수학': 85, '과학': 75})

data1 - data2

국어    10
영어   -10
수학    10
과학     0
dtype: int64

##### (인덱스 값이 다른 두 개의 시리즈인 일 경우 연산)

In [41]:
data1 = pd.Series({'국어': 90, '영어': 85, '수학': 95, '과학': 75})
data2 = pd.Series({'국어': 80, '영어': 95, '사회': 85})

data1 - data2

과학     NaN
국어    10.0
사회     NaN
수학     NaN
영어   -10.0
dtype: float64

### Series에 요소 추가 & 삭제

In [42]:
data = pd.Series({'국어': 90, '영어': 85, '수학': 95, '과학': 75})

# 요소 추가
data['미술'] = 100

# 요소 삭제
del data['영어']

data

국어     90
수학     95
과학     75
미술    100
dtype: int64

### [실습] Series 객체 만들기
- 시간 순서의 의미 또는 연속성을  담고 있는 시리즈 객체를 2개 만들기

In [92]:
import pandas as pd

a = list(range(1,13))
d = pd.Series(a)
d

0      1
1      2
2      3
3      4
4      5
5      6
6      7
7      8
8      9
9     10
10    11
11    12
dtype: int64

In [94]:
a = pd.date_range('20220101', periods=12, freq='2d')  # 2일 간격
d = pd.Series(a)
d

0    2022-01-01
1    2022-01-03
2    2022-01-05
3    2022-01-07
4    2022-01-09
5    2022-01-11
6    2022-01-13
7    2022-01-15
8    2022-01-17
9    2022-01-19
10   2022-01-21
11   2022-01-23
dtype: datetime64[ns]

In [95]:
a = pd.date_range('20220101', periods=12, freq='M') # 월간격. 단,월의 끝날 출력
d = pd.Series(a)
d

0    2022-01-31
1    2022-02-28
2    2022-03-31
3    2022-04-30
4    2022-05-31
5    2022-06-30
6    2022-07-31
7    2022-08-31
8    2022-09-30
9    2022-10-31
10   2022-11-30
11   2022-12-31
dtype: datetime64[ns]

In [96]:
a = pd.period_range(start='2022-01-01', end='2022-12-01', freq='M') # 년월만 출력
d = pd.Series(a)
d

0     2022-01
1     2022-02
2     2022-03
3     2022-04
4     2022-05
5     2022-06
6     2022-07
7     2022-08
8     2022-09
9     2022-10
10    2022-11
11    2022-12
dtype: period[M]

In [10]:
date = pd.date_range(0, periods=6, freq='3d')
date = pd.Series(date)
iris = pd.Series({'Iris-setosa':40, 'Iris-versicolor':50,'Iris-virginica':60})
iris

Iris-setosa        40
Iris-versicolor    50
Iris-virginica     60
dtype: int64

------

## 2. DataFrame 객체

### DataFrame 객체 만들기

#### A. 2차원 리스트(배열)을 사용하여 생성하기

In [43]:
import numpy as np
import pandas as pd

data = [[1,2,3],[4,5,6],[7,8,9]]  # 리스트
#data = np.array(data)             # 넘파이 배열
df = pd.DataFrame(data)

# DataFrame 이름 부여하기
df.name = 'test'
df.index.name = 'index'
df.columns.name = 'num'

# index명, column명 부여하기
df.index = ['a','b','c']
df.columns = ['c1','c2','c3']
df

df

   c1  c2  c3
a   1   2   3
b   4   5   6
c   7   8   9

#### B. Python Dictionary 자료형을 사용하여 생성

In [99]:
score_table = {'성명':['BTS','아이유','원빈','블랙핑크','나'],
              '영어':[50,60,70,80,90],
              '수학':[60,50,70,70,90]}

df = pd.DataFrame(score_table)

df.name = 'Grade Card'
df.index.name = 'name'
df.columns.name = 'subject'

df

subject    성명  영어  수학
name
0         BTS  50  60
1         아이유  60  50
2          원빈  70  70
3        블랙핑크  80  70
4           나  90  90

### 컬럼명 인덱스명 변경하기
- 리스트나 배열을 이용하여 만든 DataFrame의 인덱스 변경은 Series에서와 동일하다.

In [105]:
data = [[1,2,3],[4,5,6],[7,8,9]]  # 리스트
df = pd.DataFrame(data, columns=['c1','c2','c3'], index=['a','b','c'])
df

   c1  c2  c3
a   1   2   3
b   4   5   6
c   7   8   9

In [106]:
df.columns = ['C1','C2','C3']
df.index = ['A','B','C']
df

   C1  C2  C3
A   1   2   3
B   4   5   6
C   7   8   9

- 단, 딕셔너리와 같이 키값이 자동으로 컬럼명으로 사용된 경우에는 동일한 키값을 컬럼명으로 사용할 경우 컬럼의 위치만 변경된다.

In [107]:
df = pd.DataFrame(score_table, columns=["영어", "수학", "성명"],
                          index=["one", "two", "three", "four", "five"])

df

       영어  수학    성명
one    50  60   BTS
two    60  50   아이유
three  70  70    원빈
four   80  70  블랙핑크
five   90  90     나

In [108]:
df = pd.DataFrame(score_table, columns=["성명", "영어", "수학"],
                          index=["one", "two", "three", "four", "five"])
df

         성명  영어  수학
one     BTS  50  60
two     아이유  60  50
three    원빈  70  70
four   블랙핑크  80  70
five      나  90  90

In [109]:
df = pd.DataFrame(score_table, columns=["C1", "C2", "C3"],
                          index=["one", "two", "three", "four", "five"])
df

        C1   C2   C3
one    NaN  NaN  NaN
two    NaN  NaN  NaN
three  NaN  NaN  NaN
four   NaN  NaN  NaN
five   NaN  NaN  NaN

### DafaFrame 복사하기

In [47]:
df2 = df             # view, 메모리 공유
df3 = df.copy()      # copy, 별도의 메모리 사용
df4 = df.iloc[:,0:2] # copy, 별도의 메모리 사용
df4

         성명  영어
one     BTS  50
two     아이유  60
three    원빈  70
four   블랙핑크  80
five      나  90

### DataFrame 행(Row) & 열(Column)에 접근하기

In [111]:
score_table = {'성명':['BTS','아이유','원빈','블랙핑크','나'],
              '영어':[50,60,70,80,90],
              '수학':[60,50,70,70,90]}

df = pd.DataFrame(score_table, index=["one", "two", "three", "four", "five"] )

df.name = 'Grade Card'
df.index.name = 'name'
df.columns.name = 'subject'

df

subject    성명  영어  수학
name
one       BTS  50  60
two       아이유  60  50
three      원빈  70  70
four     블랙핑크  80  70
five        나  90  90

#### - DataFrame의 Column(열)에 접근하기

In [120]:
df['성명']  # = 
df.loc[:,['성명']]

subject    성명
name
one       BTS
two       아이유
three      원빈
four     블랙핑크
five        나

In [121]:
df[['성명', '영어']]
df.loc[:,['성명', '영어']]

subject    성명  영어
name
one       BTS  50
two       아이유  60
three      원빈  70
four     블랙핑크  80
five        나  90

#### - DataFrame의 Row(행)에 접근하기

In [114]:
# 특정 개수만큼 행 출력
df.head(3)   # df.head(n=3)

subject   성명  영어  수학
name
one      BTS  50  60
two      아이유  60  50
three     원빈  70  70

In [115]:
# 특정 조건으로 행 검색
df.query('성명=="BTS"')

subject   성명  영어  수학
name
one      BTS  50  60

In [116]:
# 특정 조건으로 컬럼값 검색
df.query('영어 > 70')['성명']

name
four    블랙핑크
five       나
Name: 성명, dtype: object

In [127]:
# 인덱스 값이 'four'인 행
df.loc['four',:]
df.loc[['two','four'], :]

subject    성명  영어  수학
name
two       아이유  60  50
four     블랙핑크  80  70

### 데이터 변경하기

#### - 컬럼(열) 값 데이터 변경

In [53]:
import numpy as np

df['영어'] = np.mean(df['영어'])

df['영어']

one      70.0
two      70.0
three    70.0
four     70.0
five     70.0
Name: 영어, dtype: float64

#### - Row(행) 값 변경하기

In [129]:
df.loc['five',:] = ['나', 100, 100]
df

subject    성명   영어   수학
name
one       BTS   50   60
two       아이유   60   50
three      원빈   70   70
four     블랙핑크   80   70
five        나  100  100

### 추가 & 삭제

#### - 열 추가하기

In [130]:
df['국어'] = np.random.randint(100)
df

subject    성명   영어   수학  국어
name
one       BTS   50   60   4
two       아이유   60   50   4
three      원빈   70   70   4
four     블랙핑크   80   70   4
five        나  100  100   4

#### - 열 추가하기: Series 만들어서 추가하기

In [131]:
# Series를 만들어서 컬럼 추가할 수도 있다
val = pd.Series([80, 70, 90], index=['two','four','five'])

df['과학'] = val
df

subject    성명   영어   수학  국어    과학
name
one       BTS   50   60   4   NaN
two       아이유   60   50   4  80.0
three      원빈   70   70   4   NaN
four     블랙핑크   80   70   4  70.0
five        나  100  100   4  90.0

#### - 행 추가하기: 열에 값 지정해서 새로운 열 추가하기

In [136]:
df.loc['six',:] = ['유재석',90,90,100,100]
df

subject    성명     영어     수학     국어     과학
name
one       BTS   50.0   60.0    4.0    NaN
two       아이유   60.0   50.0    4.0   80.0
three      원빈   70.0   70.0    4.0    NaN
four     블랙핑크   80.0   70.0    4.0   70.0
five        나  100.0  100.0    4.0   90.0
six       유재석   90.0   90.0  100.0  100.0
6         조세호   90.0   90.0   90.0  100.0

#### - 행 추가하기: 마지막에 행 추가하기

In [137]:
df.loc[len(df)] = ['조세호',90,90,90,100]
df

subject    성명     영어     수학     국어     과학
name
one       BTS   50.0   60.0    4.0    NaN
two       아이유   60.0   50.0    4.0   80.0
three      원빈   70.0   70.0    4.0    NaN
four     블랙핑크   80.0   70.0    4.0   70.0
five        나  100.0  100.0    4.0   90.0
six       유재석   90.0   90.0  100.0  100.0
6         조세호   90.0   90.0   90.0  100.0
7         조세호   90.0   90.0   90.0  100.0

#### - 행 추가하기: append함수로 DataFrame 객체를 만들어 합치기

In [142]:
df_ = pd.DataFrame(data=[['조세호',90,90,90,100]], index=['seven'],
                  columns=df.columns)
df.append(df_)
df

subject    성명     영어     수학     국어     과학
name
one       BTS   50.0   60.0    4.0    NaN
two       아이유   60.0   50.0    4.0   80.0
three      원빈   70.0   70.0    4.0    NaN
four     블랙핑크   80.0   70.0    4.0   70.0
five        나  100.0  100.0    4.0   90.0
six       유재석   90.0   90.0  100.0  100.0
6         조세호   90.0   90.0   90.0  100.0
7         조세호   90.0   90.0   90.0  100.0

#### - 열 삭제하기

In [144]:
del df['과학']
df

subject    성명     영어     수학     국어
name
one       BTS   50.0   60.0    4.0
two       아이유   60.0   50.0    4.0
three      원빈   70.0   70.0    4.0
four     블랙핑크   80.0   70.0    4.0
five        나  100.0  100.0    4.0
six       유재석   90.0   90.0  100.0
6         조세호   90.0   90.0   90.0
7         조세호   90.0   90.0   90.0

#### - 행(특정 행) 삭제하기

In [145]:
df.drop(['six'])
df.drop([7])

subject    성명     영어     수학     국어
name
one       BTS   50.0   60.0    4.0
two       아이유   60.0   50.0    4.0
three      원빈   70.0   70.0    4.0
four     블랙핑크   80.0   70.0    4.0
five        나  100.0  100.0    4.0
six       유재석   90.0   90.0  100.0
6         조세호   90.0   90.0   90.0

### 파일 읽어오기

#### - txt 파일 읽어오기

In [12]:
import pandas as pd

# 방법1
df = pd.read_table('data/data.txt', names=['숫자'])

# 방법2
df = pd.read_table('data/data.txt', header=None)
df.columns = ['숫자']

df

   숫자
0  91
1  91
2  54
3  47
4  88
5  87
6  84
7  97
8  70
9  82

In [13]:
# 방법1
df = pd.read_table('data/book.txt', sep=',', 
                  names = ['제목','영어제목','저자','국적','출판년도'])

# 방법2
df = pd.read_table('data/book.txt', sep=',', header=None)
df.columns = ['제목','영어제목','저자','국적','출판년도']
df

            제목                      영어제목            저자    국적         출판년도
0     두 도시 이야기      A Tale of Two Cities        찰스 디킨스    영어         1859
1        어린 왕자           Le Petit Prince   앙투안 드 생텍쥐페리  프랑스어         1943
2       반지의 제왕     The Lord of the Rings   J. R. R. 톨킨    영어  1954 ~ 1955
3  그리고 아무도 없었다  And Then There Were None      애거사 크리스티    영어         1939
4           호빗                The Hobbit   J. R. R. 톨킨    영어         1937

#### - csv 파일 읽어오기

pd.read_csv() 사용 <br>

- 맥은 utf-8 방식을 쓰고 윈도우는 cp949 방식 사용
- 한글 인코딩: Microsoft사에서 만든 cp949/ms949 인코딩, euc-kr인코딩, utf-8 인코딩 등등
-- 해결책 (1) - engine='python'
-- 해결책 (2) - encoding='utf-8' 
-- 해결책 (3) - encoding='cp949'  # 한글이 깨지거나 읽을 때 오류가 발생한다면
-- 해결책 (4) - Excel에서 인코딩 옵션 변경 (다른 이름으로 저장에서 - CSV UTF-8 (쉼표로 분리) 로 변경하여 저장)

In [153]:
import pandas as pd

df = pd.read_csv('data/iris.csv')
df

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
0,1,5.1,3.5,1.4,0.2,Iris-setosa
1,2,4.9,3.0,1.4,0.2,Iris-setosa
2,3,4.7,3.2,1.3,0.2,Iris-setosa
3,4,4.6,3.1,1.5,0.2,Iris-setosa
4,5,5.0,3.6,1.4,0.2,Iris-setosa
...,...,...,...,...,...,...
145,146,6.7,3.0,5.2,2.3,Iris-virginica
146,147,6.3,2.5,5.0,1.9,Iris-virginica
147,148,6.5,3.0,5.2,2.0,Iris-virginica
148,149,6.2,3.4,5.4,2.3,Iris-virginica
149,150,5.9,3.0,5.1,1.8,Iris-virginica

#### - Remote URL에서 읽어오기

In [155]:
file = 'https://archive.ics.uci.edu/ml/machine-learning-databases/iris/iris.data'

df = pd.read_csv(file)
df

     5.1  3.5  1.4  0.2     Iris-setosa
0    4.9  3.0  1.4  0.2     Iris-setosa
1    4.7  3.2  1.3  0.2     Iris-setosa
2    4.6  3.1  1.5  0.2     Iris-setosa
3    5.0  3.6  1.4  0.2     Iris-setosa
4    5.4  3.9  1.7  0.4     Iris-setosa
..   ...  ...  ...  ...             ...
144  6.7  3.0  5.2  2.3  Iris-virginica
145  6.3  2.5  5.0  1.9  Iris-virginica
146  6.5  3.0  5.2  2.0  Iris-virginica
147  6.2  3.4  5.4  2.3  Iris-virginica
148  5.9  3.0  5.1  1.8  Iris-virginica

[149 rows x 5 columns]

### [실습]  외부 데이터 읽어와  행&열 추가 및 삭제 실습하기

- 각자 자유롭게 진행하기

In [162]:
import pandas as pd

df = pd.read_csv('data/인구밀도_인구주택총조사기준__20220420232045.csv', encoding='cp949')
df

      행정구역별     2018     2019     2020
0        전국    514.4    515.7    516.2
1     서울특별시  15983.7  15926.9  15839.0
2     부산광역시   4409.8   4379.7   4348.9
3     대구광역시   2766.7   2750.3   2728.6
4     인천광역시   2761.4   2776.6   2765.1
5     광주광역시   2973.2   2972.7   2948.5
6     대전광역시   2801.0   2777.5   2758.1
7     울산광역시   1083.4   1076.9   1069.0
8   세종특별자치시    671.9    727.3    761.3
9       경기도   1286.2   1305.0   1325.3
10      강원도     90.3     90.3     90.4
11     충청북도    218.8    220.0    220.3
12     충청남도    265.1    265.4    264.0
13     전라북도    225.3    224.0    223.4
14     전라남도    145.0    144.8    144.9
15     경상북도    140.4    140.2    138.9
16     경상남도    317.9    317.6    316.2
17      제주도    355.8    359.4    362.6

### 파일 저장하기

#### - 데이터 가공하기

In [165]:
# (앞에서 사용한) 인구밀도 데이터 가공하기
df['2021'] = df['2020'] + df['2020'] * 0.1  # 2021 컬럼 추가

df['평균'] = df.mean(axis=1, numeric_only=True)

df

      행정구역별     2018     2019     2020      2021          평균
0        전국    514.4    515.7    516.2    567.82    523.3680
1     서울특별시  15983.7  15926.9  15839.0  17422.90  16134.7350
2     부산광역시   4409.8   4379.7   4348.9   4783.79   4437.0585
3     대구광역시   2766.7   2750.3   2728.6   3001.46   2784.4790
4     인천광역시   2761.4   2776.6   2765.1   3041.61   2808.5265
5     광주광역시   2973.2   2972.7   2948.5   3243.35   3004.9525
6     대전광역시   2801.0   2777.5   2758.1   3033.91   2815.0465
7     울산광역시   1083.4   1076.9   1069.0   1175.90   1090.6100
8   세종특별자치시    671.9    727.3    761.3    837.43    741.8695
9       경기도   1286.2   1305.0   1325.3   1457.83   1330.3295
10      강원도     90.3     90.3     90.4     99.44     91.7060
11     충청북도    218.8    220.0    220.3    242.33    223.1545
12     충청남도    265.1    265.4    264.0    290.40    268.5850
13     전라북도    225.3    224.0    223.4    245.74    227.3760
14     전라남도    145.0    144.8    144.9    159.39    147.0735
15     경상북도    140.4    140.2    138.9    152.79    141.6835
16     경상남도    317.9    317.6    316.2    347.82    321.7180
17      제주도    355.8    359.4    362.6    398.86    365.5390

#### - 파일 저장하기
- 해당 위치에 파일이 생성되었는지 확인한다.

In [166]:
file = 'data/인구밀도.csv' 
df.to_csv(file, encoding='cp949', mode='w', index=True)